package com.jeestudio.eco.water;

import java.util.LinkedHashMap;

/**
 * @Description: 水环境质量标准常量
 */
public class Standard {

    /**
     * 地表水环境质量标准
     */
    public static LinkedHashMap<String,double[]> dbsMap=new LinkedHashMap(){
        {
            put("w0101002",new double[]{6,9,9,9,9});  // 需要特殊判断
            put("w0101003",new double[]{7.5,6,5,3,2});
            put("w0101004",new double[]{2,4,6,10,15});
            put("w0101005",new double[]{15,15,20,30,40});
            put("w0101006",new double[]{3,3,4,6,10});
            put("w0101007",new double[]{0.15,0.5,1,1.5,2});
            put("w0101008",new double[]{0.02,0.1,0.2,0.3,0.4});  // 需要区分河流湖库
            put("w0101010",new double[]{0.01,1,1,1,1});
            put("w0101011",new double[]{0.05,1,1,2,2});
            put("w0101012",new double[]{1,1,1,1.5,1.5});
            put("w0101013",new double[]{0.01,0.01,0.01,0.02,0.02});
            put("w0101014",new double[]{0.05,0.05,0.05,0.1,0.1});
            put("w0101015",new double[]{0.00005,0.00005,0.0001,0.001,0.001});
            put("w0101016",new double[]{0.001,0.005,0.005,0.005,0.01});
            put("w0101017",new double[]{0.01,0.05,0.05,0.05,0.1});
            put("w0101018",new double[]{0.01,0.01,0.05,0.05,0.1});
            put("w0101019",new double[]{0.005,0.05,0.2,0.2,0.2});
            put("w0101020",new double[]{0.002,0.002,0.005,0.01,0.1});
            put("w0101021",new double[]{0.05,0.05,0.05,0.5,1});
            put("w0101022",new double[]{0.2,0.2,0.2,0.3,0.3});
            put("w0101024",new double[]{0.05,0.1,0.2,0.5,1});

            put("w0101009",new double[]{0.2,0.5,1.0,1.5,2.0});  // 总氮 不参与综合水质计算
            put("w0101025",new double[]{200,2000,10000,20000,40000});  // 粪大肠菌群 不参与综合水质计算

            put("bc0103094",new double[]{0.2,0.5,1.0,1.5,2.0});  // 总氮 不参与综合水质计算
            put("bc0103088",new double[]{200,2000,10000,20000,40000});  // 粪大肠菌群 不参与综合水质计算
        }
    };

    /**
     * 地表水环境质量标准补充5项+特定80项
     */
    public static LinkedHashMap<String,double[]> dbsBctdMap=new LinkedHashMap(){
        {
            put("w0102001",new double[]{250});
            put("w0102002",new double[]{250});
            put("w0102003",new double[]{10});
            put("w0102004",new double[]{0.3});
            put("w0102005",new double[]{0.1});
            put("w0103001",new double[]{0.06});
            put("w0103002",new double[]{0.002});
            put("w0103003",new double[]{0.1});
            put("w0103004",new double[]{0.02});
            put("w0103005",new double[]{0.03});
            put("w0103006",new double[]{0.02});
            put("w0103007",new double[]{0.005});
            put("w0103008",new double[]{0.03});
            put("w0103009",new double[]{0.05});
            put("w0103010",new double[]{0.07});
            put("w0103011",new double[]{0.04});
            put("w0103012",new double[]{0.002});
            put("w0103013",new double[]{0.0006});
            put("w0103014",new double[]{0.02});
            put("w0103015",new double[]{0.9});
            put("w0103016",new double[]{0.05});
            put("w0103017",new double[]{0.1});
            put("w0103018",new double[]{0.01});
            put("w0103019",new double[]{0.01});
            put("w0103020",new double[]{0.7});
            put("w0103021",new double[]{0.3});
            put("w0103022",new double[]{0.5});
            put("w0103023",new double[]{0.25});
            put("w0103024",new double[]{0.3});
            put("w0103025",new double[]{1});
            put("w0103026",new double[]{0.3});
            put("w0103027",new double[]{0.02});
            put("w0103028",new double[]{0.02});
            put("w0103029",new double[]{0.05});
            put("w0103030",new double[]{0.017});
            put("w0103031",new double[]{0.5});
            put("w0103032",new double[]{0.0003});
            put("w0103033",new double[]{0.5});
            put("w0103034",new double[]{0.05});
            put("w0103035",new double[]{0.5});
            put("w0103036",new double[]{0.093});
            put("w0103037",new double[]{0.2});
            put("w0103038",new double[]{0.009});
            put("w0103039",new double[]{0.1});
            put("w0103040",new double[]{0.0002});
            put("w0103041",new double[]{0.0005});
            put("w0103042",new double[]{0.1});
            put("w0103043",new double[]{0.003});
            put("w0103044",new double[]{0.008});
            put("w0103045",new double[]{0.01});
            put("w0103046",new double[]{0.0001});
            put("w0103047",new double[]{0.2});
            put("w0103048",new double[]{0.2});
            put("w0103049",new double[]{0.5});
            put("w0103050",new double[]{0.005});
            put("w0103051",new double[]{0.01});
            put("w0103052",new double[]{0.001});
            put("w0103053",new double[]{0.002});
            put("w0103054",new double[]{0.0002});
            put("w0103055",new double[]{0.003});
            put("w0103056",new double[]{0.002});
            put("w0103057",new double[]{0.05});
            put("w0103058",new double[]{0.08});
            put("w0103059",new double[]{0.05});
            put("w0103060",new double[]{0.05});
            put("w0103061",new double[]{0.03});
            put("w0103062",new double[]{0.01});
            put("w0103063",new double[]{0.05});
            put("w0103064",new double[]{0.02});
            put("w0103065",new double[]{0.003});
            put("w0103066",new double[]{0.0000028});
            put("w0103067",new double[]{0.000001});
            put("w0103068",new double[]{0.00002});
            put("w0103069",new double[]{0.001});
            put("w0103070",new double[]{0.003});
            put("w0103071",new double[]{0.07});
            put("w0103072",new double[]{1});
            put("w0103073",new double[]{0.002});
            put("w0103074",new double[]{0.5});
            put("w0103075",new double[]{0.005});
            put("w0103076",new double[]{0.02});
            put("w0103077",new double[]{0.7});
            put("w0103078",new double[]{0.05});
            put("w0103079",new double[]{0.1});
            put("w0103080",new double[]{0.0001});
        }
    };

    /**
     * 地下水环境质量标准
     */
    public static LinkedHashMap<String,double[]> dxsMap=new LinkedHashMap(){
        {
            put("w0201001",new double[]{5,5,15,25});
            put("w0201002",new double[]{0,0,0,0});  // 需要特殊判断
            put("w0201003",new double[]{3,3,3,10});
            put("w0201004",new double[]{0,0,0,0});  // 需要特殊判断
            put("w0201005",new double[]{6,6,6,6});  // 需要特殊判断
            put("w0201006",new double[]{150,300,450,650});
            put("w0201007",new double[]{300,500,1000,2000});
            put("w0201008",new double[]{50,150,250,350});
            put("w0201009",new double[]{50,150,250,350});
            put("w0201010",new double[]{0.1,0.2,0.3,2});
            put("w0201011",new double[]{0.05,0.05,0.1,1.5});
            put("w0201012",new double[]{0.01,0.05,1,1.5});
            put("w0201013",new double[]{0.05,0.5,1,5});
            put("w0201014",new double[]{0.01,0.05,0.2,0.5});
            put("w0201015",new double[]{0.001,0.001,0.002,0.01});
            put("w0201016",new double[]{0,0.1,0.3,0.3});
            put("w0201017",new double[]{1,2,3,10});
            put("w0201018",new double[]{0.02,0.1,0.5,1.5});
            put("w0201019",new double[]{0.005,0.01,0.02,0.1});
            put("w0201020",new double[]{100,150,200,400});
            put("w0201021",new double[]{3,3,3,100});
            put("w0201022",new double[]{100,100,100,1000});
            put("w0201023",new double[]{0.01,0.1,1,4.8});
            put("w0201024",new double[]{2,5,20,30});
            put("w0201025",new double[]{0.001,0.01,0.05,0.1});
            put("w0201026",new double[]{1,1,1,2});
            put("w0201027",new double[]{0.04,0.04,0.08,0.5});
            put("w0201028",new double[]{0.0001,0.0001,0.001,0.002});
            put("w0201029",new double[]{0.001,0.001,0.01,0.05});
            put("w0201030",new double[]{0.01,0.01,0.01,0.1});
            put("w0201031",new double[]{0.0001,0.001,0.005,0.01});
            put("w0201032",new double[]{0.005,0.01,0.05,0.1});
            put("w0201033",new double[]{0.005,0.005,0.01,0.1});
            put("w0201034",new double[]{0.5,6,60,300});
            put("w0201035",new double[]{0.5,0.5,2,50});
            put("w0201036",new double[]{0.5,1,10,120});
            put("w0201037",new double[]{0.5,140,700,1400});
            put("w0201038",new double[]{0.1,0.1,0.5,0.5});  // 四类五类特殊处理
            put("w0201039",new double[]{0.1,1,1,1});  // 四类五类特殊处理
            put("w0202001",new double[]{0.0001,0.0001,0.002,0.06});
            put("w0202002",new double[]{0.02,0.1,0.5,2});
            put("w0202003",new double[]{0.0001,0.0005,0.005,0.01});
            put("w0202004",new double[]{0.01,0.1,0.7,4});
            put("w0202005",new double[]{0.002,0.002,0.02,0.1});
            put("w0202006",new double[]{0.005,0.005,0.05,0.1});
            put("w0202007",new double[]{0.001,0.01,0.07,0.15});
            put("w0202008",new double[]{0.001,0.01,0.05,0.1});
            put("w0202009",new double[]{0.0001,0.0001,0.0001,0.001});
            put("w0202010",new double[]{1,2,20,500});
            put("w0202011",new double[]{0.5,3,30,40});
            put("w0202012",new double[]{0.5,400,2000,4000});
            put("w0202013",new double[]{0.5,0.5,5,60});
            put("w0202014",new double[]{0.5,0.5,5,60});
            put("w0202015",new double[]{0.5,10,100,800});
            put("w0202016",new double[]{0.5,0.5,5,90});
            put("w0202017",new double[]{0.5,3,30,60});
            put("w0202018",new double[]{0.5,5,50,60});
            put("w0202019",new double[]{0.5,7,70,210});
            put("w0202020",new double[]{0.5,4,40,300});
            put("w0202021",new double[]{0.5,60,300,600});
            put("w0202022",new double[]{0.5,200,1000,2000});
            put("w0202023",new double[]{0.5,30,300,600});
            put("w0202024",new double[]{0.5,4,20,180});
            put("w0202025",new double[]{0.5,30,300,600});
            put("w0202026",new double[]{0.5,100,500,1000});
            put("w0202027",new double[]{0.5,2,20,40});
            put("w0202028",new double[]{0.1,0.5,5,60});
            put("w0202029",new double[]{0.1,0.5,5,30});
            put("w0202030",new double[]{1,10,100,600});
            put("w0202031",new double[]{1,360,1800,3600});
            put("w0202032",new double[]{1,50,240,480});
            put("w0202033",new double[]{0.1,0.4,4,8});
            put("w0202034",new double[]{0.002,0.002,0.01,0.5});
            put("w0202035",new double[]{0.05,0.05,0.5,10});
            put("w0202036",new double[]{3,3,8,300});
            put("w0202037",new double[]{0.05,20,200,300});
            put("w0202038",new double[]{0.05,0.9,9,18});
            put("w0202039",new double[]{0.01,0.5,5,300});
            put("w0202040",new double[]{0.01,0.2,2,150});
            put("w0202041",new double[]{0.01,0.1,1,2});
            put("w0202042",new double[]{0.01,0.1,1,2});
            put("w0202043",new double[]{0.01,0.04,0.4,0.8});
            put("w0202044",new double[]{0.1,6,30,150});
            put("w0202045",new double[]{0.05,1.4,7,14});
            put("w0202046",new double[]{0.05,0.6,3,30});
            put("w0202047",new double[]{0.05,0.1,1,2});
            put("w0202048",new double[]{0.05,4,20,40});
            put("w0202049",new double[]{0.05,25,250,500});
            put("w0202050",new double[]{0.05,16,80,160});
            put("w0202051",new double[]{0.05,6,30,60});
            put("w0202052",new double[]{0.05,1,10,150});
            put("w0202053",new double[]{0.05,0.4,2,600});
            put("w0202054",new double[]{0.1,140,700,1400});
        }
    };

    /**
     * 指标编码-名称映射
     */
    public static LinkedHashMap<String,String> itemNameMap=new LinkedHashMap(){
        {
            put("w0101001","水温");
            put("w0101002","pH值");
            put("w0101003","溶解氧");
            put("w0101004","高锰酸盐指数");
            put("w0101005","化学需氧量");
            put("w0101006","五日生化需氧量");
            put("w0101007","氨氮");
            put("w0101008","总磷");
            put("w0101009","总氮");
            put("bc0103094","总氮");
            put("w0101010","铜");
            put("w0101011","锌");
            put("w0101012","氟化物");
            put("w0101013","硒");
            put("w0101014","砷");
            put("w0101015","汞");
            put("w0101016","镉");
            put("w0101017","铬(六价)");
            put("w0101018","铅");
            put("w0101019","氰化物");
            put("w0101020","挥发酚");
            put("w0101021","石油类");
            put("w0101022","阴离子表面活性剂");
            put("w0101024","硫化物");  // 硫化物一开始编码错了，这里不改了，把粪大肠菌群往后编
            put("w0101025","粪大肠菌群");
            put("bc0103088","粪大肠菌群");
            put("w0102001","硫酸盐");
            put("w0102002","氯化物");
            put("w0102003","硝酸盐(以N计)");
            put("w0102004","铁");
            put("w0102005","锰");
            put("w0103001","三氯甲烷");
            put("w0103002","四氯化碳");
            put("w0103003","三溴甲烷");
            put("w0103004","二氯甲烷");
            put("w0103005","1,2-二氯乙烷");
            put("w0103006","环氧氯丙烷");
            put("w0103007","氯乙烯");
            put("w0103008","1,1-二氯乙烯");
            put("w0103009","1,2-二氯乙烯");
            put("w0103010","三氯乙烯");
            put("w0103011","四氯乙烯");
            put("w0103012","氯丁二烯");
            put("w0103013","六氯丁二烯");
            put("w0103014","苯乙烯");
            put("w0103015","甲醛");
            put("w0103016","乙醛");
            put("w0103017","丙烯醛");
            put("w0103018","三氯乙醛");
            put("w0103019","苯");
            put("w0103020","甲苯");
            put("w0103021","乙苯");
            put("w0103022","二甲苯(总量)");
            put("w0103023","异丙苯");
            put("w0103024","氯苯");
            put("w0103025","1,2-二氯苯");
            put("w0103026","1,4-二氯苯");
            put("w0103027","三氯苯(总量)");
            put("w0103028","四氯苯(总量)");
            put("w0103029","六氯苯");
            put("w0103030","硝基苯");
            put("w0103031","二硝基苯(总量)");
            put("w0103032","2,4-二硝基甲苯");
            put("w0103033","2,4,6-三硝基甲苯");
            put("w0103034","硝基氯苯(总量)");
            put("w0103035","2,4-二硝基氯苯");
            put("w0103036","2,4-二氯苯酚");
            put("w0103037","2,4,6-三氯苯酚");
            put("w0103038","五氯酚");
            put("w0103039","苯胺");
            put("w0103040","联苯胺");
            put("w0103041","丙烯酰胺");
            put("w0103042","丙烯腈");
            put("w0103043","邻苯二甲酸二丁酯");
            put("w0103044","邻苯二甲酸二(2-乙基己基)酯");
            put("w0103045","水合肼");
            put("w0103046","四乙基铅");
            put("w0103047","吡啶");
            put("w0103048","松节油");
            put("w0103049","苦味酸");
            put("w0103050","丁基黄原酸");
            put("w0103051","活性氯");
            put("w0103052","滴滴涕");
            put("w0103053","林丹");
            put("w0103054","环氧七氯");
            put("w0103055","对硫磷");
            put("w0103056","甲基对硫磷");
            put("w0103057","马拉硫磷");
            put("w0103058","乐果");
            put("w0103059","敌敌畏");
            put("w0103060","敌百虫");
            put("w0103061","内吸磷");
            put("w0103062","百菌清");
            put("w0103063","甲萘威");
            put("w0103064","溴氰菊酯");
            put("w0103065","阿特拉津");
            put("w0103066","苯并(a)芘");
            put("w0103067","甲基汞");
            put("w0103068","多氯联苯(总量)");
            put("w0103069","微囊藻毒素-LR");
            put("w0103070","黄磷");
            put("w0103071","钼");
            put("w0103072","钴");
            put("w0103073","铍");
            put("w0103074","硼");
            put("w0103075","锑");
            put("w0103076","镍");
            put("w0103077","钡");
            put("w0103078","钒");
            put("w0103079","钛");
            put("w0103080","铊");
            put("w0201001","色(度)");
            put("w0201002","嗅和味");
            put("w0201003","浑浊度");
            put("w0201004","肉眼可见物");
            put("w0201005","pH");
            put("w0201006","总硬度(CaCO3计)");
            put("w0201007","溶解性总固体");
            put("w0201008","硫酸盐");
            put("w0201009","氯化物");
            put("w0201010","铁");
            put("w0201011","锰");
            put("w0201012","铜");
            put("w0201013","锌");
            put("w0201014","铝");
            put("w0201015","挥发性酚类(以苯酚计)");
            put("w0201016","阴离子表面活性剂");
            put("w0201017","耗氧量(CODMn法，以O2计)");
            put("w0201018","氨氮(以N计)");
            put("w0201019","硫化物");
            put("w0201020","钠");
            put("w0201021","总大肠菌群");
            put("w0201022","菌落总数");
            put("w0201023","亚硝酸盐(以N计)");
            put("w0201024","硝酸盐(以N计)");
            put("w0201025","氰化物");
            put("w0201026","氟化物");
            put("w0201027","碘化物");
            put("w0201028","汞");
            put("w0201029","砷");
            put("w0201030","硒");
            put("w0201031","镉");
            put("w0201032","铬(六价)");
            put("w0201033","铅");
            put("w0201034","三氯甲烷");
            put("w0201035","四氯化碳");
            put("w0201036","苯");
            put("w0201037","甲苯");
            put("w0201038","总α放射性");
            put("w0201039","总β放射性");
            put("w0202001","铍");
            put("w0202002","硼");
            put("w0202003","锑");
            put("w0202004","钡");
            put("w0202005","镍");
            put("w0202006","钴");
            put("w0202007","钼");
            put("w0202008","银");
            put("w0202009","铊");
            put("w0202010","二氯甲烷");
            put("w0202011","1,2-二氯乙烷");
            put("w0202012","1,1,1-三氯乙烷");
            put("w0202013","1,1,2-三氯乙烷");
            put("w0202014","1,2-二氯丙烷");
            put("w0202015","三溴甲烷");
            put("w0202016","氯乙烯");
            put("w0202017","1,1-二氯乙烯");
            put("w0202018","1,2-二氯乙烯");
            put("w0202019","三氯乙烯");
            put("w0202020","四氯乙烯");
            put("w0202021","氯苯");
            put("w0202022","邻二氯苯");
            put("w0202023","对二氯苯");
            put("w0202024","三氯苯(总量)");
            put("w0202025","乙苯");
            put("w0202026","二甲苯(总量)");
            put("w0202027","苯乙烯");
            put("w0202028","2,4-二硝基甲苯");
            put("w0202029","2,6-二硝基甲苯");
            put("w0202030","萘");
            put("w0202031","蒽");
            put("w0202032","荧蒽");
            put("w0202033","苯并(b)荧蒽");
            put("w0202034","苯并(a)芘");
            put("w0202035","多氯联苯(总量)");
            put("w0202036","邻苯二甲酸二(2-乙基己基)酯");
            put("w0202037","2,4,6-三氯酚");
            put("w0202038","五氯酚");
            put("w0202039","六六六(总量)");
            put("w0202040","γ-六六六(林丹)");
            put("w0202041","滴滴涕(总量)");
            put("w0202042","六氯苯");
            put("w0202043","七氯");
            put("w0202044","2,4-滴");
            put("w0202045","克百威");
            put("w0202046","涕灭威");
            put("w0202047","敌敌畏");
            put("w0202048","甲基对硫磷");
            put("w0202049","马拉硫磷");
            put("w0202050","乐果");
            put("w0202051","毒死蜱");
            put("w0202052","百菌清");
            put("w0202053","莠去津");
            put("w0202054","草甘膦");
        }
    };

    // 重金属指标（饮用水）
    public static String[] zjs=new String[]{"w0101010","w0101011","w0101013","w0101014","w0101015","w0101016","w0101017","w0101018","w0102004","w0102005","w0103071","w0103072","w0103073","w0103075","w0103076","w0103077","w0103078","w0103079","w0103080",
            "w0201010","w0201011","w0201012","w0201013","w0201028","w0201029","w0201030","w0201031","w0201032","w0201033","w0202001","w0202003","w0202004","w0202005","w0202006","w0202007","w0202008","w0202009"};

    // 有机物指标（饮用水）
    public static String[] yjw=new String[]{"w0101020","w0101021","w0101022","w0103001","w0103002","w0103003","w0103004","w0103005","w0103006","w0103007","w0103008","w0103009","w0103010","w0103011","w0103012","w0103013","w0103014","w0103015","w0103016","w0103017","w0103018","w0103019","w0103020","w0103021","w0103022","w0103023","w0103024","w0103025","w0103026","w0103027","w0103028","w0103029","w0103030","w0103031","w0103032","w0103033","w0103034","w0103035","w0103036","w0103037","w0103038","w0103039","w0103040","w0103041","w0103042","w0103043","w0103044","w0103046","w0103047","w0103048","w0103049","w0103050","w0103052","w0103053","w0103054","w0103055","w0103056","w0103057","w0103058","w0103059","w0103060","w0103061","w0103062","w0103063","w0103064","w0103065","w0103066","w0103067","w0103068","w0103069","w0201015","w0201016","w0201034","w0201035","w0201036","w0201037","w0202010","w0202011","w0202012","w0202013","w0202014","w0202015","w0202016","w0202017","w0202018","w0202019","w0202020","w0202021","w0202022","w0202023","w0202024","w0202025","w0202026","w0202027","w0202028","w0202029","w0202030","w0202031","w0202032","w0202033","w0202034","w0202035","w0202036","w0202037","w0202038","w0202039","w0202040","w0202041","w0202042","w0202043","w0202044","w0202045","w0202046","w0202047","w0202048","w0202049","w0202050","w0202051","w0202052","w0202053","w0202054"};
}
